blog-posts/2003-07-28-interesting-mail-stats.org
#+TITLE: Interesting mail stats

July 28th, 2003 -
[[http://sachachua.com/blog/p/948][http://sachachua.com/blog/p/948]]

I ran [[http://sachachua.com/notebook/emacs/gnus-stat.el][gnus-stat.el]]
on my mail.misc mailbox and these stats came up:
 (my name appears because I gcc myself)

#+BEGIN_EXAMPLE
    Total number of posts: 3421
    Average bytes/post: 9682.003508
    Total number of posters: 546
    Average posts/poster: 6.265568

    1100 Sacha Chua

    113 Richi Plana
    85 Apache
    80 Eric Vidal
    58 Luis F. G. Sarmenta, Ph.D.
    53 gino@cersa.admu.edu.ph
    52 Thomas Gehrlein
    49 Harvey Chua
    41 mario carreon
    38 Dominique Cimafranca
    35 -marc-
    34 Martin Gomez
    31 Aadisht Khanna
    26 Ma. Mercedes T. Rodrigo
    25 Marc Fabie
    24 Rogelio M. Serrano Jr.
    23 Seiryu Seikun
    21 mchangho@ateneo.edu
    21 Dean Michael Berris
    19 Ronald Abigan


    Total number of subjects: 1578
    Average posts/subject: 2.167934


    74
    53 none
    35 sachawiki: Welcome Page
    23 twiddler
    23 hi
    19 proposal for information exchange
    17 Hi!
    15 greetings from the outside world
    14 Reply on the display power supply plus class site and parallel interfacing lecture
    14 planner.el
    14 sachawiki: On Love
    13 just want to say hi
    13 Topic Reply Notification - On helping: what is too much help?
    13 CS 123 and CS 231
    13 sachawiki: 2003.06.04
    13 CS123 client interview on Tuesday
    12 [SFiles] 20021227: The One with the Assignment
    12 hello
    12 Topic Reply Notification - On Open vs Proprietary Formats
    12 planner.el bugfix and minor changes
#+END_EXAMPLE

Fascinating.
