blog-posts/2003-07-28-interesting-mail-stats.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Interesting mail stats</title>
<!-- 2014-04-30 Wed 17:05 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Interesting mail stats</h1>
<p>
July 28th, 2003 -
<a href="http://sachachua.com/blog/p/948"><a href="http://sachachua.com/blog/p/948">http://sachachua.com/blog/p/948</a></a>
</p>

<p>
I ran <a href="http://sachachua.com/notebook/emacs/gnus-stat.el">gnus-stat.el</a>
on my mail.misc mailbox and these stats came up:
 (my name appears because I gcc myself)
</p>

<pre class="example">
Total number of posts: 3421
Average bytes/post: 9682.003508
Total number of posters: 546
Average posts/poster: 6.265568

1100 Sacha Chua

113 Richi Plana
85 Apache
80 Eric Vidal
58 Luis F. G. Sarmenta, Ph.D.
53 gino@cersa.admu.edu.ph
52 Thomas Gehrlein
49 Harvey Chua
41 mario carreon
38 Dominique Cimafranca
35 -marc-
34 Martin Gomez
31 Aadisht Khanna
26 Ma. Mercedes T. Rodrigo
25 Marc Fabie
24 Rogelio M. Serrano Jr.
23 Seiryu Seikun
21 mchangho@ateneo.edu
21 Dean Michael Berris
19 Ronald Abigan


Total number of subjects: 1578
Average posts/subject: 2.167934


74
53 none
35 sachawiki: Welcome Page
23 twiddler
23 hi
19 proposal for information exchange
17 Hi!
15 greetings from the outside world
14 Reply on the display power supply plus class site and parallel interfacing lecture
14 planner.el
14 sachawiki: On Love
13 just want to say hi
13 Topic Reply Notification - On helping: what is too much help?
13 CS 123 and CS 231
13 sachawiki: 2003.06.04
13 CS123 client interview on Tuesday
12 [SFiles] 20021227: The One with the Assignment
12 hello
12 Topic Reply Notification - On Open vs Proprietary Formats
12 planner.el bugfix and minor changes
</pre>

<p>
Fascinating.
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
